; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v8 ?v7)
             (pred_10 ?v2 ?v3)
             (pred_11 ?v8 ?v3)
             (pred_2 ?v4 ?v8 )
	     (pred_12 ?v8)
             (pred_9 ?v6)
             (pred_4 ?v2)
             (pred_7 ?v3)
             (pred_5 ?v8)
             (pred_3 ?v2)
             (pred_1 ?v8)
             (pred_6 ))



(:action op_4
:parameters (?v13 ?v12 ?v1 ?v9)
:precondition (and (pred_9 ?v13) (pred_9 ?v12) (pred_4 ?v1) (pred_7 ?v9)
          (pred_8 ?v13 ?v12) (pred_10 ?v1 ?v9)
                   (pred_11 ?v12 ?v9) (pred_12 ?v13) 
                   (pred_5 ?v12) (pred_3 ?v1))
:effect (and  (pred_1 ?v12) (not (pred_5 ?v12))))


(:action op_3
:parameters (?v13 ?v10)
:precondition (and (pred_9 ?v13) (pred_9 ?v10)
               (pred_12 ?v13) (pred_8 ?v13 ?v10) (pred_1 ?v10))
:effect (and (pred_12 ?v10) (not (pred_12 ?v13))))

(:action op_2
:parameters (?v13 ?v1)
:precondition (and (pred_9 ?v13) (pred_4 ?v1) 
                  (pred_12 ?v13) (pred_2 ?v1 ?v13) (pred_6 ))
:effect (and (pred_3 ?v1)
   (not (pred_2 ?v1 ?v13)) (not (pred_6 ))))


(:action op_5
:parameters (?v13 ?v5 ?v11)
:precondition (and (pred_9 ?v13) (pred_4 ?v5) (pred_4 ?v11)
                  (pred_12 ?v13) (pred_3 ?v11) (pred_2 ?v5 ?v13))
:effect (and (pred_3 ?v5) (pred_2 ?v11 ?v13)
        (not (pred_3 ?v11)) (not (pred_2 ?v5 ?v13))))

(:action op_1
:parameters (?v13 ?v1)
:precondition (and (pred_9 ?v13) (pred_4 ?v1) 
                  (pred_12 ?v13) (pred_3 ?v1))
:effect (and (pred_6 ) (pred_2 ?v1 ?v13) (not (pred_3 ?v1)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_05 obj_20 obj_27 obj_03 obj_21 obj_14 obj_19 obj_07 obj_13 obj_30 obj_08 obj_09 obj_16 obj_31 obj_24 obj_26 obj_29 obj_10 obj_15 obj_06 obj_12 obj_22 obj_02 obj_04 obj_18
    obj_01 obj_11 obj_28
    obj_25 obj_17 obj_23
    )

    (:init
       (pred_6)

       (pred_9 obj_05)
       (pred_9 obj_20)
       (pred_9 obj_27)
       (pred_9 obj_03)
       (pred_9 obj_21)
       (pred_9 obj_14)
       (pred_9 obj_19)
       (pred_9 obj_07)
       (pred_9 obj_13)
       (pred_9 obj_30)
       (pred_9 obj_08)
       (pred_9 obj_09)
       (pred_9 obj_16)
       (pred_9 obj_31)
       (pred_9 obj_24)
       (pred_9 obj_26)
       (pred_9 obj_29)
       (pred_9 obj_10)
       (pred_9 obj_15)
       (pred_9 obj_06)
       (pred_9 obj_12)
       (pred_9 obj_22)
       (pred_9 obj_02)
       (pred_9 obj_04)
       (pred_9 obj_18)
       (pred_7 obj_01)
       (pred_7 obj_11)
       (pred_7 obj_28)
       (pred_4 obj_25)
       (pred_4 obj_17)
       (pred_4 obj_23)

       (pred_8 obj_05 obj_14)
       (pred_8 obj_05 obj_20)
       (pred_8 obj_20 obj_19)
       (pred_8 obj_20 obj_27)
       (pred_8 obj_20 obj_05)
       (pred_8 obj_27 obj_07)
       (pred_8 obj_27 obj_03)
       (pred_8 obj_27 obj_20)
       (pred_8 obj_03 obj_13)
       (pred_8 obj_03 obj_21)
       (pred_8 obj_03 obj_27)
       (pred_8 obj_21 obj_30)
       (pred_8 obj_21 obj_03)
       (pred_8 obj_14 obj_08)
       (pred_8 obj_14 obj_19)
       (pred_8 obj_14 obj_05)
       (pred_8 obj_19 obj_09)
       (pred_8 obj_19 obj_07)
       (pred_8 obj_19 obj_20)
       (pred_8 obj_19 obj_14)
       (pred_8 obj_07 obj_16)
       (pred_8 obj_07 obj_13)
       (pred_8 obj_07 obj_27)
       (pred_8 obj_07 obj_19)
       (pred_8 obj_13 obj_31)
       (pred_8 obj_13 obj_30)
       (pred_8 obj_13 obj_03)
       (pred_8 obj_13 obj_07)
       (pred_8 obj_30 obj_24)
       (pred_8 obj_30 obj_21)
       (pred_8 obj_30 obj_13)
       (pred_8 obj_08 obj_26)
       (pred_8 obj_08 obj_09)
       (pred_8 obj_08 obj_14)
       (pred_8 obj_09 obj_29)
       (pred_8 obj_09 obj_16)
       (pred_8 obj_09 obj_19)
       (pred_8 obj_09 obj_08)
       (pred_8 obj_16 obj_10)
       (pred_8 obj_16 obj_31)
       (pred_8 obj_16 obj_07)
       (pred_8 obj_16 obj_09)
       (pred_8 obj_31 obj_15)
       (pred_8 obj_31 obj_24)
       (pred_8 obj_31 obj_13)
       (pred_8 obj_31 obj_16)
       (pred_8 obj_24 obj_06)
       (pred_8 obj_24 obj_30)
       (pred_8 obj_24 obj_31)
       (pred_8 obj_26 obj_12)
       (pred_8 obj_26 obj_29)
       (pred_8 obj_26 obj_08)
       (pred_8 obj_29 obj_22)
       (pred_8 obj_29 obj_10)
       (pred_8 obj_29 obj_09)
       (pred_8 obj_29 obj_26)
       (pred_8 obj_10 obj_02)
       (pred_8 obj_10 obj_15)
       (pred_8 obj_10 obj_16)
       (pred_8 obj_10 obj_29)
       (pred_8 obj_15 obj_04)
       (pred_8 obj_15 obj_06)
       (pred_8 obj_15 obj_31)
       (pred_8 obj_15 obj_10)
       (pred_8 obj_06 obj_18)
       (pred_8 obj_06 obj_24)
       (pred_8 obj_06 obj_15)
       (pred_8 obj_12 obj_22)
       (pred_8 obj_12 obj_26)
       (pred_8 obj_22 obj_02)
       (pred_8 obj_22 obj_29)
       (pred_8 obj_22 obj_12)
       (pred_8 obj_02 obj_04)
       (pred_8 obj_02 obj_10)
       (pred_8 obj_02 obj_22)
       (pred_8 obj_04 obj_18)
       (pred_8 obj_04 obj_15)
       (pred_8 obj_04 obj_02)
       (pred_8 obj_18 obj_06)
       (pred_8 obj_18 obj_04)
       (pred_5 obj_21)
       (pred_5 obj_13)
       (pred_5 obj_18)
       (pred_11  obj_21 obj_01)
       (pred_11  obj_13 obj_11)
       (pred_11  obj_18 obj_28)
       (pred_1 obj_05)
       (pred_1 obj_20)
       (pred_1 obj_27)
       (pred_1 obj_03)
       (pred_1 obj_14)
       (pred_1 obj_19)
       (pred_1 obj_07)
       (pred_1 obj_30)
       (pred_1 obj_08)
       (pred_1 obj_09)
       (pred_1 obj_16)
       (pred_1 obj_31)
       (pred_1 obj_24)
       (pred_1 obj_26)
       (pred_1 obj_29)
       (pred_1 obj_10)
       (pred_1 obj_15)
       (pred_1 obj_06)
       (pred_1 obj_12)
       (pred_1 obj_22)
       (pred_1 obj_02)
       (pred_1 obj_04)

       (pred_10  obj_25 obj_01)
       (pred_10  obj_17 obj_11)
       (pred_10  obj_23 obj_28)
       (pred_2 obj_25 obj_09)
       (pred_2 obj_17 obj_02)
       (pred_2 obj_23 obj_24)
       (pred_12 obj_15)
    )

    (:goal (and
       (pred_2 obj_25 obj_12)
       (pred_2 obj_17 obj_27)
    ))
(:constraints
  (always (not (pred_12 obj_10)))
)
)

; plan
1. (op_3 obj_15 obj_04)
   deleted: (pred_12 obj_15)
   added: (pred_12 obj_04)
   goals met: 0 of 2
2. (op_3 obj_04 obj_02)
   deleted: (pred_12 obj_04)
   added: (pred_12 obj_02)
   goals met: 0 of 2
3. (op_2 obj_02 obj_17)
   deleted: (pred_2 obj_17 obj_02) (pred_6)
   added: (pred_3 obj_17)
   goals met: 0 of 2
4. (op_3 obj_02 obj_22)
   deleted: (pred_12 obj_02)
   added: (pred_12 obj_22)
   goals met: 0 of 2
5. (op_3 obj_22 obj_29)
   deleted: (pred_12 obj_22)
   added: (pred_12 obj_29)
   goals met: 0 of 2
6. (op_3 obj_29 obj_09)
   deleted: (pred_12 obj_29)
   added: (pred_12 obj_09)
   goals met: 0 of 2
7. (op_5 obj_09 obj_25 obj_17)
   deleted: (pred_3 obj_17) (pred_2 obj_25 obj_09)
   added: (pred_3 obj_25) (pred_2 obj_17 obj_09)
   goals met: 0 of 2
8. (op_3 obj_09 obj_29)
   deleted: (pred_12 obj_09)
   added: (pred_12 obj_29)
   goals met: 0 of 2
9. (op_3 obj_29 obj_22)
   deleted: (pred_12 obj_29)
   added: (pred_12 obj_22)
   goals met: 0 of 2
10. (op_3 obj_22 obj_12)
   deleted: (pred_12 obj_22)
   added: (pred_12 obj_12)
   goals met: 0 of 2
11. (op_1 obj_12 obj_25)
   deleted: (pred_3 obj_25)
   added: (pred_6) (pred_2 obj_25 obj_12)
   goals met: 1 of 2
12. (op_3 obj_12 obj_22)
   deleted: (pred_12 obj_12)
   added: (pred_12 obj_22)
   goals met: 1 of 2
13. (op_3 obj_22 obj_29)
   deleted: (pred_12 obj_22)
   added: (pred_12 obj_29)
   goals met: 1 of 2
14. (op_3 obj_29 obj_09)
   deleted: (pred_12 obj_29)
   added: (pred_12 obj_09)
   goals met: 1 of 2
15. (op_2 obj_09 obj_17)
   deleted: (pred_2 obj_17 obj_09) (pred_6)
   added: (pred_3 obj_17)
   goals met: 1 of 2
16. (op_3 obj_09 obj_19)
   deleted: (pred_12 obj_09)
   added: (pred_12 obj_19)
   goals met: 1 of 2
17. (op_3 obj_19 obj_20)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_20)
   goals met: 1 of 2
18. (op_3 obj_20 obj_27)
   deleted: (pred_12 obj_20)
   added: (pred_12 obj_27)
   goals met: 1 of 2
19. (op_1 obj_27 obj_17)
   deleted: (pred_3 obj_17)
   added: (pred_6) (pred_2 obj_17 obj_27)
   goals met: 2 of 2
